import React, {useState} from "react";
import Weather from './Weather'

function List() {
    const [value, setValue] = useState('Абакан');
    const city = ['Абакан', 'Анадырь', 'Архангельск', 'Астрахань', 'Барнаул', 'Белгород', 'Биробиджан', 'Благовещенск',
    'Брянск', 'Великий Новгород', 'Владивосток', 'Владикавказ', 'Владимир', 'Волгоград', 'Вологда', 'Воронеж',
    'Горно-Алтайск', 'Грозный', 'Екатеринбург', 'Иваново', 'Ижевск', 'Иркутск', 'Йошкар-Ола', 'Казань', 'Калининград',
    'Калуга', 'Кемерово', 'Киров', 'Кострома', 'Краснодар', 'Красноярск', 'Курган', 'Курск', 'Кызыл', 'Липецк',
    'Магадан', 'Магас', 'Майкоп', 'Махачкала', 'Москва', 'Мурманск', 'Нальчик', 'Нарьян-Мар', 'Нижний Новгород',
    'Новосибирск', 'Омск', 'Оренбург', 'Орёл', 'Пенза', 'Пермь', 'Петрозаводск', 'Петропавловск-Камчатский', 'Псков',
    'Ростов-на-Дону', 'Рязань', 'Салехард', 'Самара', 'Санкт-Петербург', 'Саранск', 'Саратов', 'Севастополь',
    'Симферополь', 'Смоленск', 'Ставрополь', 'Сыктывкар', 'Тамбов', 'Тверь', 'Томск', 'Тула', 'Тюмень', 'Улан-Удэ',
    'Ульяновск', 'Уфа', 'Хабаровск', 'Ханты-Мансийск', 'Чебоксары', 'Челябинск', 'Черкесск', 'Чита', 'Элиста',
    'Южно-Сахалинск', 'Якутск', 'Ярославль'
    ];

	function handleChange(event) {
		setValue(event.target.value);
	}
	return <div>
		<select value={value} onChange={handleChange}>
			{city.map(x => <option>{x}</option>)}

		</select>
		<Weather {...{value}}/>

	</div>;
}

export default List;